# CannotMoveHostedFixtureViaCopyMonitor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyMonitorFailures..::..CannotMoveHostedFixtureViaCopyMonitor Property
BuiltInFailures..::..CopyMonitorFailures Class See Also
---
The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMoveHostedFixtureViaCopyMonitor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMoveHostedFixtureViaCopyMonitor As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMoveHostedFixtureViaCopyMonitor {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyMonitorFailures Class
Autodesk.Revit.DB Namespace